import React, { FC } from 'react';

import * as S from './styles';

type Props = {
    imagePath: string;
}

const AboutMain: FC<Props> = ({ imagePath }) => {  
  return (
    <S.Container>
      <S.Portrait>
        <img src={imagePath} alt="portrait"/>
      </S.Portrait>

      <div>
        <h1>VLADA</h1>
        <S.ItemWrapper>
          <p>У Влады была невероятная способность видеть во всех и во всём только лучшее. Светлее, добрее и жизнерадостнее человека я никогда не встречала. Она озаряла каждую комнату, в которой появлялась. Влада была поэтом, фотографом, огнём, водой - и умиротворённым солнечным утренним лесом. Когда она обнимала - всё плохое, тревожное и несчастное, что может чувствовать человек, испарялось. Оставалось только чувство безопасности и тепла. </p>

          <p>Помню, однажды Влада узнала, что я постоянно пишу. Она умела видеть прекрасное в делах людей и отмечать это - так произошло и тогда. И она принесла мне показать нечто по-настоящему ценное. В тот день она отозвала меня в сторону, долго смотрела в пол - и протянула мне стопку листов А4: «Вот, почитай, пожалуйста. Там ничего особенного, но я тоже всегда пишу».</p>

          <p>Это самое особенное, что для меня когда-либо делали. Она словно запустила меня в самое сердце. Это было робко, осторожно - и драгоценно. В текстах Влады было всё: печаль (которую было не увидеть на её лице и не услышать в разговорах), любовь (которая переполняла её), свобода (которая была доступна ей на очень глубоком уровне) и, конечно, желание вновь увидеть Сицилию - место её сердца, её души. Каждый раз, когда я думаю о ней, я стараюсь представлять её именно там: на этом тёплом маленьком острове, где никуда не торопятся и с наслаждением проводят каждый день, каждую его секунду.</p>

          <p>Влада - моя главная учительница в умении ценить каждую грань жизни. Я не знаю, как ей это удавалось. Она будто была рождена со способностью быть счастливой даже тогда, когда это казалось немыслимым. Красота повсюду. Она видела её везде, в каждом. Словно её глаза и её сердце были настроены на другую волну, доступную лишь единицам. Таких людей встречаешь, наверное, лишь раз. Тех, кто готов любить тебя вопреки и именно за то, какой ты в самой своей сути. В тебе не может быть ничего плохого, ты есть - и это прекрасно.</p>

          <p>Я многое не знаю о Владе. Мы практически не говорили о прошлом, настоящее всегда было важнее. И за то настоящее, в котором она клала свою голову мне на плечо, говорила, что любит, и обнимала - я бы сейчас отдала очень много.</p>

          <S.Sign>Полина Васильева</S.Sign>
        </S.ItemWrapper>
        <S.ItemWrapper>
          <p>Влада была воплощением любви. В частности — к литературе. Ещё в школе она то и дело прятала под партой какую-нибудь книжку и читала. Особенно ей нравились сказки Джанни Родари и роман Анны Гавальда “Просто вместе”.</p>

          <p>Влада любила писать истории сама, придумывать сказки, фотографировать. Это было делом её жизни. Увлекалась оперой и мюзиклами. Играла в любительском театре, занималась волонтёрством.</p>

          <p>Любила ирисы.</p>

          <p>Она была влюблена в Петербург (и город любил её в ответ). Ещё подростком, в 14 лет, три месяца прожила в Сицилии. Вообще много переезжала, знакомилась с множеством разных людей. Притягивала к себе ярких и необычных.</p>

          <p>На специальность мечты, на кафедру кино- и фотоискусства, поступила не с первой попытки. Год после школы работала официанткой в “Буше”, а в свободное время оттачивала знания и навыки в фотографии. Во время учёбы несколько раз уходила в академ для лечения — и всегда возвращалась. Ей действительно нравилось учиться, она по-настоящему в это вкладывалась.</p>

          <p>Любила стихотворение Бродского “Прощай” — и теперь для меня оно во многом про неё саму.</p>

          <S.Sign>Таня Зимина, Елена Русских, Рита Маматказина</S.Sign>
        </S.ItemWrapper>
      </div>
    </S.Container>
  );
};

export default AboutMain;
